app/controllers/books_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["body", "15:04"], ["updated_at", "2019-06-15 06:04:33.543821"], ["id", 1]]
---
  def edit
    @book = Book.find(params[:id])
    if @book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "books" SET "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["body", "15:22"], ["updated_at", "2019-06-15 06:21:42.893987"], ["id", 2]]
---
  def update
    book = Book.find(params[:id])
    book.update(book_params)

SELECT "books".* FROM "books" ORDER BY "books"."created_at" DESC
---
  def index
    @book = Book.new
    @books = Book.all.order(created_at: :desc)

INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "6/15"], ["body", "15:23"], ["created_at", "2019-06-15 06:22:31.062369"], ["updated_at", "2019-06-15 06:22:31.062369"]]
---
  def create
    book = Book.new(book_params)
      if book.save